// Задача 34: Задайте массив заполненный случайными положительными трёхзначными числами. 
// Напишите программу, которая покажет количество чётных чисел в массиве.
// [345, 897, 568, 234] -> 2


int[] CreateArrayRndInt(int size, int min = 100, int max = 999)
{
    int[] arr = new int[size];
    Random rnd = new Random();
    for (int i = 0; i < arr.Length; i++)
    {
        arr[i] = rnd.Next(min, max + 1);
    }
    return arr;
 }

void PrintArray(int[] arr)
{
    Console.Write("[");
    for (int i = 0; i < arr.Length; i++)
    {
        if (i < arr.Length - 1) Console.Write(arr[i] + ",");
        else Console.Write(arr[i]);
    }
    Console.WriteLine("]");
}

int EvenNumbers(int[] arr)
{
    int count = 0;
    for (int i = 0; i < arr.Length; i++)
    {
        if (arr[i] % 2 == 0) count = count + 1;
    }
    return count;
}

Console.Write("Введите длину массива, заполенного трехзначными числами: ");
int size = Convert.ToInt32(Console.ReadLine());
int[] array = CreateArrayRndInt(size);
PrintArray(array);
int evenNumbers=EvenNumbers(array);
Console.WriteLine($"В данном массиве {evenNumbers} четных чисел");